      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. cobolTimes.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       PERFORM MAIN-PROCEDURE 10 TIMES.
       MAIN-PROCEDURE.
            DISPLAY "Hello world".

       END PROGRAM cobolTimes.
